Classes/Junior Year/January 2019/Assignment 3/Task 7/TUT6/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "2/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    pipe_superfine_walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          27764;
        startFace       316696;
    }
    pipe_superfine_outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          254;
        startFace       344460;
    }
    pipe_superfine_inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          254;
        startFace       344714;
    }
)

// ************************************************************************* //
